mihcaelcaplan/photOS_dc-01/board/pin_mux.h
/* GPIO_B0_11 (coord A10), LCDIF_D7/BT_CFG[7]/LCDIF_D7/BT_CFG[7]/J49[A17] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D7_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D7_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D7_CHANNEL                                       7U   /*!< Signal channel */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9]/LCDIF_D9/BT_CFG[9]/J49[A19] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D9_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D9_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D9_CHANNEL                                       9U   /*!< Signal channel */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10]/LCDIF_D10/BT_CFG[10]/J49[A20] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D10_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D10_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D10_CHANNEL                                     10U   /*!< Signal channel */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11]/LCDIF_D11/BT_CFG[11]J49[A8] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D11_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D11_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D11_CHANNEL                                     11U   /*!< Signal channel */

/* GPIO_B1_00 (coord A11), LCDIF_D12/LCDIF_D12/J49[A9] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D12_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D12_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D12_CHANNEL                                     12U   /*!< Signal channel */

/* GPIO_B1_01 (coord B11), LCDIF_D13/LCDIF_D13/J49[A10] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D13_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D13_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D13_CHANNEL                                     13U   /*!< Signal channel */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8]/LCDIF_D8/BT_CFG[8]/J49[A18] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D8_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D8_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D8_CHANNEL                                       8U   /*!< Signal channel */

/* GPIO_B1_02 (coord C11), LCDIF_D14/LCDIF_D14/J49[A11] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D14_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D14_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D14_CHANNEL                                     14U   /*!< Signal channel */

/* GPIO_B1_03 (coord D11), LCDIF_D15/LCDIF_D15/J49[A12] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D15_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D15_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D15_CHANNEL                                     15U   /*!< Signal channel */

/* GPIO_B1_04 (coord E12), ENET_RXD0/ENET_RXD0/U18[16] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD0_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD0_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD0_CHANNEL                                     16U   /*!< Signal channel */

/* GPIO_B1_05 (coord D12), ENET_RXD1/ENET_RXD1/U18[15] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD1_PERIPHERAL                                LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD1_SIGNAL                               lcdif_data   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD1_CHANNEL                                     17U   /*!< Signal channel */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE/LCDIF_ENABLE/J49[A34] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_ENABLE_PERIPHERAL                             LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_ENABLE_SIGNAL                          lcdif_enable   /*!< Signal name */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC/LCDIF_HSYNC/J49[A32] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_HSYNC_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_HSYNC_SIGNAL                            lcdif_hsync   /*!< Signal name */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC/LCDIF_VSYNC/J49[A33] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_VSYNC_PERIPHERAL                              LCDIF   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_VSYNC_SIGNAL                            lcdif_vsync   /*!< Signal name */

/* GPIO_AD_B0_14 (coord H14), CSI_PWREN */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_PWREN_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_PWREN_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CSI_PWREN_CHANNEL                                     14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CSI_PWREN_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CSI_PWREN_GPIO_PIN                                    14U   /*!< GPIO pin number */
#define BOARD_INITPINS_CSI_PWREN_GPIO_PIN_MASK                       (1U << 14U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_CSI_PWREN_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_CSI_PWREN_PIN                                         14U   /*!< PORT pin number */
#define BOARD_INITPINS_CSI_PWREN_PIN_MASK                            (1U << 14U)   /*!< PORT pin mask */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J35[8]/J23[3]/CSI_PIXCLK/J46[8]/BT_DEV_WAKE/U9[9]/J33[3] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_PIXCLK_PERIPHERAL                                 CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_PIXCLK_SIGNAL                              csi_pixclk   /*!< Signal name */

