mihcaelcaplan/photOS_dc-01/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_RXER_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_RXER_GPIO_PIN                                    27U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_RXER_GPIO_PIN_MASK                       (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_RXER_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_RXER_PIN                                         27U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_RXER_PIN_MASK                            (1U << 27U)   /*!< PORT pin mask */

/* GPIO_B1_08 (coord A12), ENET_TXD1/ENET_TXD1/U18[25] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD1_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD1_CHANNEL                                     24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_TXD1_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD1_GPIO_PIN                                    24U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_TXD1_GPIO_PIN_MASK                       (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_TXD1_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD1_PIN                                         24U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_TXD1_PIN_MASK                            (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B1_09 (coord A13), ENET_TXEN/ENET_TXEN/U18[23] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXEN_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXEN_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXEN_CHANNEL                                     25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_TXEN_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_TXEN_GPIO_PIN                                    25U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_TXEN_GPIO_PIN_MASK                       (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_TXEN_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_TXEN_PIN                                         25U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_TXEN_PIN_MASK                            (1U << 25U)   /*!< PORT pin mask */

/* GPIO_B1_07 (coord B12), ENET_TXD0/ENET_TXD0/U18[24] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD0_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD0_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD0_CHANNEL                                     23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_TXD0_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD0_GPIO_PIN                                    23U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_TXD0_GPIO_PIN_MASK                       (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_TXD0_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD0_PIN                                         23U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_TXD0_PIN_MASK                            (1U << 23U)   /*!< PORT pin mask */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV/ENET_CRS_DV/U18[18] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_CRS_DV_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_CRS_DV_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_CRS_DV_CHANNEL                                   22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_CRS_DV_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_CRS_DV_GPIO_PIN                                  22U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_CRS_DV_GPIO_PIN_MASK                     (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_CRS_DV_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_CRS_DV_PIN                                       22U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_CRS_DV_PIN_MASK                          (1U << 22U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD/UART1_TXD/J13[2] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_UART1_TXD_PERIPHERAL                        LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_UART1_TXD_SIGNAL                                 TX   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD/UART1_RXD/J11[2] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_UART1_RXD_PERIPHERAL                        LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_UART1_RXD_SIGNAL                                 RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0/SEMC_A0/U16[H7] */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_A0_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_A0_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_A0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_10 (coord G1), SEMC_A1/SEMC_A1/U16[H8] */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_A1_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_A1_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_A1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_11 (coord G3), SEMC_A2/SEMC_A2/U16[J8] */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_A2_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_A2_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_A2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_12 (coord H1), SEMC_A3/SEMC_A3/U16[J7] */
/* Routed pin properties */
#define BOARD_INITSDRAM_SEMC_A3_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAM_SEMC_A3_SIGNAL                                      ADDR   /*!< Signal name */
#define BOARD_INITSDRAM_SEMC_A3_CHANNEL                                       3U   /*!< Signal channel */

